Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode
Defines modes which can be used by a SpatialFieldPrimitive to hide the original referenced element.
Since:
2013
Since:
2013

Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideWholeElement
Hide the whole referenced element.

Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideOnlyReference
Hide only the referenced face or curve.

Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.HideNone
Do not hide any piece of the original model element.

Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.Default
For ColoredSurface display style, hide only the referenced face passed at the primitive creation time.
For DeformedShape display style, hide only the referenced face or curve passed at the primitive creation time.